install: # команда make install в каталоге проекта установит зависимости из package-lock.json
	npm ci

brain-games: # запуск игры Brain Games
	node bin/brain-games.js

publish: # симуляция публикации пакета в npm-репозиторий без фактической публикации
# npm проводит все проверки, которые обычно выполняются при публикации, 
# но не отправляет пакет на сервер npm и не изменяет состояние репозитория
	npm publish --dry-run 

link: # глобальная установка пакета из локальной директории, её необходимо запускать из корневой директории проекта
# Это позволяет использовать пакет как глобально установленный модуль, доступный в любом проекте на компьютере
# так будто он был установлен глобально через npm install -g
	npm link

lint:
	npx eslint